
#Ваша програма має перенести останній елемент списку з кінця на початок, тобто, останній елемент списку має стати першим.
#Послідовність інших елементів не має змінюватися.
#Порожній список або список з одним елементом повинен залишитися незмінним.
#Кількість елементів у списку може бути будь-яким – нуль та більше!
#Приклади
#[12, 3, 4, 10] => [10, 12, 3, 4]
#[1] => [1]
#[] => [] print("you can't divide by zero")
#[12, 3, 4, 10, 8] => [8, 12, 3, 4, 10]

lst1 = [1, 2, 3, 4, 9]
x = len(lst1)
if x == 0:
    print(lst1)
else:
    a = lst1.pop()
    lst1.insert(0, a)
    print(lst1)



