x = int(input('Enter a five-digit number:'))
q1 = int(x/10000)
q2 = int((x-(q1*10000))/1000)
q3 = int((x-(q1*10000)-(q2*1000))/100)
q4 = int((x-(q1*10000)-(q2*1000)-(q3*100))/10)
q5 = int((x-(q1*10000)-(q2*1000)-(q3*100)-(q4*10)))
print(q5,q4,q3,q2,q1)

#Написати програму, яка просить користувача ввести 4-х значне число з клавіатури,
#після чого друкує на екрані стовпчик цифр, з якого це число складається.
#Наприклад, користувач вводить 1234, а програма виводить:
#Завдання необхідно вирішити, використовуючи методи поділу (підказка // і % або divmod).
#Виведення в стовпчик можна зробити за допомогою 4-х функцій print.
#Користувач може ввести будь-яке 4 значне ціле число.
#Будь-яке 4-х значне число - це число, яке складається з 4-х цифр, де кожна цифра може бути від 0 до 9 включно.
#Ваше рішення має це враховувати! Якщо користувач ввів не ціле число, це проблема користувача, а не вашої програми.
#Створюйте рішення, виходячи з того, що число ЗАВЖДИ 4-хзначне.
x = int(input('Enter a four-digit number:'))
z4, y4 = divmod(x, 10)
z3, y3 = divmod(z4, 10)
z2, y2 = divmod(z3, 10)
z1, y1 = divmod(z2, 10)
print(y1)
print(y2)
print(y3)
print(y4)